app/views/posts/_post_form.html.haml

SELECT "communities".* FROM "communities" INNER JOIN "user_community_relationships" ON "communities".id = "user_community_relationships".community_id WHERE (("user_community_relationships".user_id = 1)) ORDER BY communities.name ASC
---
				.community
					= check_box_tag "post[community_ids][]", community.id, @post.communities.include?(community)