app/controllers/posts_controller.rb

  def index
    @user_id = params[:user_id] || nil
    if @user_id.nil?
      @title = "All Posts"
      @posts = Post.active.paginate(:page => params[:page])
    else
      @user = User.find(@user_id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."active" = 't' AND ("posts".user_id = 1) ORDER BY posts.created_at DESC LIMIT 30 OFFSET 0
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def new
    @title = "Create Post"
    @post = Post.new
    @states = State.all
    @cities = City.all
    @is_tradable = Tradable.all
    @goods = Category.find_all_by_category_type("Goods")
---
SELECT "states".* FROM "states" ORDER BY states.name ASC
SELECT "cities".* FROM "cities" ORDER BY cities.name ASC
SELECT "tradables".* FROM "tradables"
SELECT "categories".* FROM "categories" WHERE "categories"."category_type" = 'Goods'

  def create
    if signed_in?
      @post = current_user.posts.build(params[:post])
      if @post.save
---
INSERT INTO "posts" ("title", "description", "trade_for", "city_id", "user_id", "created_at", "updated_at", "active", "email", "activation_hash", "activated_at") VALUES ('a', 'a', 'a', 3, NULL, '2011-06-05 15:51:33.483349', '2011-06-05 15:51:33.483349', 'f', 'hardik1447@yahoo.co.in', '0d4f49bef9ca045cbd2fd7b1180ea8e274a838e383d25facd98bc8f3f85135a8', NULL)

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 7 ORDER BY posts.created_at DESC LIMIT 1

  def search
    @inputs = params[:post]
    if @inputs.nil?
      @title = "Post Search"
      @query = nil
      @posts = Post.search(@query)
---
SELECT "posts".* FROM "posts" WHERE (lower(title) LIKE '%abc%' OR lower(description) LIKE '%abc%') ORDER BY posts.created_at DESC